class speedController {

    static async findOne(ctx) {
        ctx.response.status = 200;
        ctx.body = {
            code: 200,
            msg: '查找配置详情成功',
            data: {
                serverTotal: {
                    x: ["2023", "2024", "2025", "2026", "2027", "2028"],
                    y1: ["30000", "50002", "34790", "56980", "45566", "43620"],
                    y2: ["30000", "50002", "34790", "56980", "45566", "43620"],
                    y3: ["30000", "50002", "34790", "56980", "45566", "43620"],
                    y4: ["30000", "50002", "34790", "56980", "45566", "43620"]
                },
                radiation: {
                    x: ["2023", "2024", "2025", "2026", "2027", "2028"],
                    y1: ["30000", "50002", "34790", "56980", "45566", "43620"],
                    y2: ["30000", "50002", "34790", "56980", "45566", "43620"],
                },
                ecg: {
                    x: ["2023", "2024", "2025", "2026", "2027", "2028"],
                    y1: ["30000", "50002", "34790", "56980", "45566", "43620"],
                    y2: ["30000", "50002", "34790", "56980", "45566", "43620"],
                },
                work: {
                    one: [
                        {
                            name: "超声诊断数",
                            sl: "100",
                        },
                        {
                            name: "超声诊断用户数",
                            sl: "12200",
                        },
                    ],
                    two: [
                        {
                            name: "心电诊断数",
                            sl: "1020",
                        },
                        {
                            name: "心电检测用户数",
                            sl: "100",
                        },
                    ],
                    three: [
                        {
                            name: "放射治疗数",
                            sl: "10110",
                        },
                        {
                            name: "放射治疗用户数",
                            sl: "1020",
                        },
                    ],
                    four: [
                        {
                            name: "远程诊断数",
                            sl: "1020",
                        },
                        {
                            name: "远程诊断用户数",
                            sl: "100",
                        },
                    ]
                },
                orginenters:[100,200,300],
                shadowColud:[{
                    "name": "江岸区",
                    "value": "1000"
                  },
                  {
                    "name": "硚口区",
                    "value": "2000"
                  },
                  {
                    "name": "东湖高新区",
                    "value": "300"
                  },
                  {
                    "name": "武昌区",
                    "value": "440"
                  },
                  {
                    "name": "江汉区",
                    "value": "44"
                  }, {
                    "name": "汉阳区",
                    "value": "989"
                  }, {
                    "name": "江岸区",
                    "value": "499"
                  }, {
                    "name": "武昌区",
                    "value": "222"
                  }, {
                    "name": "青山区",
                    "value": "35"
                  }, {
                    "name": "洪山区",
                    "value": "566"
                  }, {
                    "name": "蔡甸区",
                    "value": "90"
                  }, {
                    "name": "江夏区",
                    "value": "489"
                  }, {
                    "name": "黄陂区",
                    "value": "13"
                  }, {
                    "name": "新洲区",
                    "value": "22"
                  },
                  {
                    "name": "经接开发区",
                    "value": "489"
                  },
                  {
                    "name": "汉南区",
                    "value": "78"
                  }
        
                ],

                diagnosisYang: {
                  num: "300",
                  total: "1000"
              },
                diagnosisYing: {
                    num: "700",
                    total: "1000"
                },
                diagnosisRadio: [{
                    value: 300,
                    name: "阴性",
                },
                {
                    value: 500,
                    name: "阳性",
                },
                {
                    value: 200,
                    name: "待检测",
                }],
                patient: {
                    x: ["门诊", "急诊", "体检", "住院", "其他"],
                    y1: ["30000", "50002", "34790", "56980", "45566", "43620"],
                }

            }
        }

    }

}


module.exports = speedController;